import { SelectOption } from "@/types/common";

const typeOption: SelectOption[] = [
  { label: "การขายปลีก", value: 1 },
  { label: "ที่พักแรม", value: 2 },
  { label: "การบริการอาหารและเครื่องดื่ม", value: 3 },
  {
    label:
      "การผลิตภาพยนตร์ วีดิทัศน์ และรายการโทรทัศน์ การบันทึกเสียงลงบนสื่อ การจัดผังรายการและการแพร่ภาพกระจายเสียง และกิจกรรมสำนักข่าว",
    value: 4,
  },
  {
    label:
      "การให้เช่าของใช้ส่วนบุคคลและของใช้ในครัวเรือน และกิจกรรมการคัดเลือกนักแสดงภาพยนตร์โทรทัศน์ และการแสดงอื่นๆ",
    value: 5,
  },
  { label: "กิจกรรมศิลปะ ความบันเทิง และนันทนาการ", value: 6 },
  {
    label:
      "การซ่อมของใช้ส่วนบุคคลและของใช้ในครัวเรือน และกิจกรรมการบริการส่วนบุคคลอื่นๆ",
    value: 7,
  },
];

export default typeOption;
